app/controllers/slivers_controller.rb

def create

  @sliver = Sliver.new(params[:sliver])

  if @sliver.save
  get_code = Iteration.find(:first)
---
INSERT INTO `slivers` (`link_type`, `long_url`, `mini_key`, `created_at`, `title`, `updated_at`, `tweaze_date`, `email`) VALUES(NULL, 'http://silhouettesolutions.net/images/logo.png', NULL, '2009-12-06 21:13:05', 'Test', '2009-12-06 21:13:05', '2009-12-07', NULL)
SELECT * FROM `iterations` WHERE (`iterations`.`id` = 1)

  @b.upto(@b) do |c2|
    @c.upto(@c) do |c3|
      @d.upto(@d) do |c4|
@mcreate = Sliver.update(@sliver.id,{:mini_key => [chars[c1], chars[c2], chars[c3], chars[c4]].join})
@icreate = Iteration.update(1,{:a => @a, :b => @b, :c =>@c, :d => @d})
---
UPDATE `slivers` SET `updated_at` = '2009-12-04 17:41:23', `mini_key` = 'ooo8' WHERE `id` = 2
UPDATE `iterations` SET `updated_at` = '2009-12-04 17:41:23', `d` = 1 WHERE `id` = 1

def show
  @sliver = Sliver.find_by_mini_key(params[:id])
---
SELECT * FROM `slivers` WHERE (`slivers`.`mini_key` = 'ooop') LIMIT 1

def shadow_display

  @sliver = Sliver.find_by_mini_key(params[:sliver])
---
SELECT * FROM `slivers` WHERE (`slivers`.`mini_key` = 'ooo9') LIMIT 1